a = [0,10,20,30,40,50,60,70,80,90]
#a[2], a[3], a[4] 사이에 a의 값이 들어갔음.
'''a[2:5] = 'a'
print(a)'''

#인덱스 부분이 삭제되고, 해당 부분이 들어간다
'''a[2:5] = 'a','b','c','d','e'
print(a)'''

# a[2],a[4],a[6]에 값이 딱 맞게 들어감
#증가폭을 지정했을 경우, 슬라이스 범위의 요소 개수와 할당할 요소의 개수가 정확히 일치해야함

'''a[2:8:2]=['a','b','c']
print(a)'''

#튜플 문자열 range에는 할당이 불가능함
'''b = (0,10,20,30,40,50,60,70,80,90)
b[2:5]=('a','b','c')
print(b)'''

'''r = range(10)
r[2:5] = 'a'
print(r)'''


#del을 활용하여 슬라이스를 삭제하기
'''del a[2:5]
print(a)'''

'''del a[2:8:2]
print(a)'''

#튜플, 문자열, range는 삭제되지않음

'''year = [2011,2012,2013,2014,2015,2016,2017,2018]
population = [10249679, 10195318, 10143645, 10103233, 10022181, 9930616, 9857426, 9838892]

print(year[5:])
print(population[5:])'''

'''n = -32,75,97,-10,9,32,4,-15,0,76,14,2
print(n[1::2])'''

'''x = input("입력해주세요 : ").split()
del x[-5:]
print(tuple(x))'''

x = input("첫번쨰 문자열을 입력해주세요 : ")
y = input("두번쨰 문자열을 입력해주세요 : ")
print(x[::2] + y[1::2])

